tap "homebrew/bundle"
brew "bat"
brew "eza"
brew "fd"
brew "git-delta"
brew "jq"
brew "navi"
brew "ripgrep"
brew "sd"
brew "tldr"
brew "tree"
brew "zoxide"
cask "flameshot"
cask "maccy"
vscode "DavidAnson.vscode-markdownlint"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "golang.go"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "vscodevim.vim"
vscode "zxh404.vscode-proto3"
